{
"movies":[
{
	"id": "038001",
	"title": "300 Rise of an Empire",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038001.jpg",
    "summary": "After its victory over Leonidas' 300, the Persian Army under the command of Xerxes marches towards the major Greek city-states. The Democratic city of Athens, first on the path of Xerxes' army, bases its strength on its fleet, led by admiral Themistocles. Themistocles is forced to an unwilling alliance with the traditional rival of Athens, oligarchic Sparta whose might lies with its superior infantry troops. But Xerxes still reigns supreme in numbers over sea and land.",
    "cast": "Sullivan Stapleton, Eva Green, Lena Headey",
	"director":  "Noam Murro",
    "year": "2014",
    "trailer": "https://www.youtube.com/watch?v=2zqy21Z29ps"
  }
,{
	"id": "038002",
	"title": "Elysium",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038002.jpg",
    "summary": "In the year 2154, two classes of people exist: the very wealthy, who live on a pristine man-made space station called Elysium, and the rest, who live on an overpopulated, ruined Earth. Secretary Delacourt, a government official, will stop at nothing to enforce anti-immigration laws and preserve the luxurious lifestyle of the citizens of Elysium. That doesn't stop the people of Earth from trying to get in by any means they can. When unlucky Max is backed into a corner, he agrees to take on a daunting mission that, if successful, will not only save his life but could bring equality to these polarized worlds.",
    "cast": "Matt Damon, Jodie Foster, Sharlto Copley",
	"director":  "Neill Blomkamp",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=oIBtePb-dGY"
  }
,{
	"id": "038003",
	"title": "Man of Steel",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038003.jpg",
    "summary": "Kal-El, son of Jor-El and Lara, is sent to Earth after his home planet Krypton leads to a complete incineration. Now taking the name Clark Kent, he then discovers his true persona when he is guided to become Superman: A hero committed to protect Earth's fate and the harm that threatens it. However, General Zod, a citizen of Krypton and its military leader looks at Earth's fate differently and decides to use it with a sacrifice for all humans. Superman, with the help of present military and news reporter Lois Lane makes an alliance together to stop Zod from obliterating human existence.",
    "cast": "Henry Cavill, Amy Adams, Michael Shannon",
	"director":  "Zack Snyder",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=T6DJcgm3wNY"
  }
,{
	"id": "038004",
	"title": "Thor: The Dark World",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038004.jpg",
    "summary": "A year after Loki's devastating alien attack on New York, the Mighty Thor along with his friends Lady Sif and the Warriors Three fight to save the Nine Realms from deadly threats. When Thor's girlfriend Jane Foster discovers a fluid like weapon called the Aether, she unknowingly awakens the evil Malekith and his Dark Elf army. With this, Asgard may be facing it's darkest hour. Thor forms an uneasy alliance with his nemesis Loki to save Jane, stop Malekith and save the Nine Realms from total chaos and darkness.",
    "cast": "Chris Hemsworth, Natalie Portman, Tom Hiddleston",
	"director":  "Alan Taylor",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=npvJ9FTgZbM"
  }
,{
	"id": "038005",
	"title": "The Wolverine",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038005.jpg",
    "summary": "Logan has been living a desolate life following the death of Jean Grey at his hands. A Japanese girl goes to see him and tells him that a man he knew in World War 2 and saved his life is now dying and wants to see him. When he sees him, the man offers to make Logan mortal but Logan refuses. Later the man dies. At his funeral, some men try to grab the man's grand daughter. Logan saves her but when they shoot him Logan doesn't heal. They continue to go to a place where the girl feels safe. But men keep on finding them and the doctor who was treating the man, asks a Samurai who pledged to protect the girl, to bring her Logan. Logan still continues to deal with what happened to Jean.",
    "cast": "Hugh Jackman, Will Yun Lee, Tao Okamoto",
	"director":  "James Mangold",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=WEbzZP-_Ssc"
}
,{
	"id": "038006",
	"title": "White House Down",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038006.jpg",
    "summary": "The North-American President James Sawyer proposes a global peace plan frustrating the arms industry. Meanwhile Capitol security agent John Cale had made an application for the secret service to protect the president and travels for an interview with Agent Finnerty in Washington with his eleven year-old daughter Emily. Cale is not accepted and he goes with Emily on a tour in the White House. Out of the blue, the White House is invaded and overtaken by a terrorist group led by Stenz, and Cale fights against the paramilitary group to save his daughter and the president while disclosing high treason and coup d'état sponsored by the arms industry.",
    "cast": "Channing Tatum, Jamie Foxx, Maggie Gyllenhaal ",
	"director":  "Roland Emmerich",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=hVdXl-_DvZk"
}
,{
	"id": "038007",
	"title": "Black Rock",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038007.jpg",
    "summary": "Sarah travels with her friend Lou to spend the weekend camping in the remote Black Rock Island that was part of their childhood. When they arrive to get their motor boat, Lou sees Abby waiting for Sarah and they decide to give up traveling to the island. Lou and Abby were friends in the past but after an incident with Abby's boyfriends, they have been estranged for many years and do not talk to each other. However, Sarah convinces them to travel with her to Black Rock. When they are resolving their issues, they meet their former schoolmate Henry that is hunting with his friends from the army Derek and Alex that worship Henry and Abby invites them to have dinner and drink with them on the beach. Abby gets drunk and she flirts with Henry and he makes a move on her. There is a tragic accident with Henry and his friends decide to revenge him.",
    "cast": "Katie Aselton, Lake Bell, Kate Bosworth",
	"director":  "Katie Aselton",
    "year": "2012",
    "trailer": "https://www.youtube.com/watch?v=8u756yHZ_Ww"
}
,{
	"id": "038008",
	"title": "Star Trek Into Darkness",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038008.jpg",
    "summary": "The latest mission of the USS Enterprise crew takes them into deep space to rescue an endangered species from an active volcano. However, once again Captain Kirk's reckless behavior compromises the mission and nearly gets him booted from Starfleet. Turning back to his mentor Admiral Pike, Kirk is demoted to an academy cadet and has to start over. However, when a ruthless warlord attacks Starfleet and shoots Admiral Pike in the process, Kirk takes command and takes the Enterprise deep into the neutral zone and the Klingon homeworld. Unknown to the crew, a Starfleet renegade is manipulating the Federation and the Klingons into a possible war. Kirk, Spock and the rest of the crew must stop the war before all hell breaks loose. And what awaits the crew of the USS Enterprise on their forthcoming five-year mission?",
    "cast": "Chris Pine, Zachary Quinto, Zoe Saldana",
	"director":  "J.J. Abrams",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=QAEkuVgt6Aw"
}
,{
	"id": "038009",
	"title": "300 Rise of an Empire",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038009.jpg",
    "summary": "In 1933, in San Francisco, a boy visits the Wild West in a sideshow and meets an elderly Tonto in a chamber and the Comanche tells the story of The Lone Ranger to him. In 1869, the idealistic prosecutor John Reid returns by train to his hometown Colby. In the same train, it is traveling the criminal Butch Cavendish that will be judged for his crimes and hanged in the town due to a request of Latham Cole, who represents the railroad company. However, Butch escapes and John rides with his brother Dan Reid and six other Texas Rangers to capture him. However, the rangers are ambushed and killed by the notorious outlaw and his gang and only John survives. He teams up with Tonto to bring Butch Cavendish to justice in a dangerous journey of discoveries.",
    "cast": "Johnny Depp, Armie Hammer, William Fichtner",
	"director":  "Gore Verbinski",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=JjFsNSoDZK8"
}
,{
	"id": "038010",
	"title": "World War Z",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038010.jpg",
    "summary": "When former U.N. investigator Gerry Lane and his family get stuck in urban gridlock, he senses that it's no ordinary traffic jam. His suspicions are confirmed when, suddenly, the city erupts into chaos. A lethal virus, spread through a single bite, is turning healthy people into something vicious, unthinking and feral. As the pandemic threatens to consume humanity, Gerry leads a worldwide search to find the source of the infection and, with luck, a halt to it's spread.",
    "cast": "Brad Pitt, Mireille Enos, Daniella Kertesz",
	"director":  "Marc Forster",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=Md6Dvxdr0AQ"
}
,{
	"id": "038011",
	"title": "Star Trek",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038011.jpg",
    "summary": "On the day of James Kirk's birth, his father dies on his damaged starship in a last stand against a Romulan mining vessel looking for Ambassador Spock, who in this time, has grown on Vulcan disdained by his neighbors for his half-human heritage. 25 years later, James T. Kirk has grown into a young rebellious troublemaker. Challenged by Captain Christopher Pike to realize his potential in Starfleet, he comes to annoy academy instructors like Commander Spock. Suddenly, there is an emergency on Vulcan and the newly-commissioned USS Enterprise is crewed with promising cadets like Nyota Uhura, Hikaru Sulu, Pavel Chekov and even Kirk himself, thanks to Leonard McCoy's medical trickery. Together, this crew will have an adventure in the final frontier where the old legend is altered forever as a new version of the legend begins.",
    "cast": "Chris Pine, Zachary Quinto, Simon Pegg",
	"director":  "J.J. Abrams",
    "year": "2009",
    "trailer": "https://www.youtube.com/watch?v=pKFUZ10Wmbw"
}
,{
	"id": "038012",
	"title": "Hidden in the Woods",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038012.jpg",
    "summary": "Hidden in the Woods tells the story of two sisters who have been raised in isolation, subjected to the torment of their abusive, drug dealing father. When they finally decide to report him to the police, he kills the two officers and is put in jail. But things go from bad to worse when the girls must answer to their Uncle Costello, a psychotic drug kingpin, who shows up looking for his missing merchandise which is hidden in the woods.",
    "cast": "Michael Biehn, Jeannine Kaspar, Electra Avellan",
	"director":  "Patricio Valladares",
    "year": "2014",
    "trailer": "https://www.youtube.com/watch?v=XSvatfT5fO4"
}
,{
	"id": "038013",
	"title": "Pirates of the Caribbean: Dead Men Tell No Tales",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038013.jpg",
    "summary": "Captain Salazar, a deadly ghost escapes the Devil's triangle with his crew and is taking over the seas in search of his arch-rival and author of all his pain, Jack Sparrow. In the meantime, Jack is approached by a boy who needs to locate the Trident of Poseidon, something he believes only Sparrow can help him find. Carina Smyth an astronomer and horologist joins the team to help them find something she believes her father had always wanted her to find. Jack's only hope is to find the mythical Trident of Poseidon, who's master gets control of all the seas, or so it's said.",
    "cast": "Johnny Depp, Geoffrey Rush, Javier Bardem",
	"director":  "Joachim Rønning, Espen Sandberg",
    "year": "2017",
    "trailer": "https://www.youtube.com/watch?v=Ak9DOPQ0Mhg"
}
,{
	"id": "038014",
	"title": "Joy",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038014.jpg",
    "summary": "Joy has always been fascinated by creating things, This pursuit was always supported emotionally by her maternal grandmother, Mimi. Joy feels that lack of practical support has led to others making fortunes on ideas she came up with years ago but could not act upon manufacturing. Despite being broke, Joy is the person in her extended family to whom everyone has always turned, in the process forgoing her own life, including not having attended college to help see her parents through their divorce. She works in an unsatisfying job as an Eastern Airlines ticket clerk; and lives with her mother Terry who spends all day in bed watching soap operas; her ex-husband Tony, a less than successful aspiring Latino Tom Jones wannabe; and their two children. Added to this mix is her father Rudy, the owner of a failing heavy-duty garage, which is managed by Joy's older half-sister Peggy, with whom she has somewhat of a strained relationship, and for which Joy does the books. Sharon, Rudy's latest girlfriend who has just dumped him, drops him off on Joy's doorstep, making Joy's home life even more complicated as Rudy does not get along with either Terry or Tony. Joy begins to feel buried by her life, in the process her childhood dream of making things seemingly getting farther and farther away. As such, Joy decides to make some changes in her life, and expects the unquestioning practical support of her family. Those changes include manufacturing a new product of her design; what she chooses this time around being a self-wringing mop. That support also includes being able to pitch the idea to Rudy's current wealthy girlfriend, Trudy. Even if she does get to the manufacturing stage, Joy will have to battle the narrow minds of business executives in marketing her product, that is unless she can find a way to get into the homes of the American public in one fell swoop. But nothing is a done deal until the consumer forks out his/her hard earned money for the product and all the legal issues are dealt with. Joy has to decide if she will 'pick up the gun' as Trudy asked in their initial investment meeting in dealing with an especially troublesome legal issue.",
    "cast": "Jennifer Lawrence, Robert De Niro, Bradley Cooper",
	"director":  "David O. Russell",
    "year": "2015",
    "trailer": "https://www.youtube.com/watch?v=2zqy21Z29ps"
}
,{
	"id": "038015",
	"title": "Before I Fall",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038015.jpg",
    "summary": "What if you had only one day to change absolutely everything? Samantha Kingston has it all: the perfect friends, the perfect guy, and a seemingly perfect future. Then, everything changes. After one fateful night, Sam wakes up with no future at all. Trapped reliving the same day over and over she begins to question just how perfect her life really was. And as she begins to untangle the mystery of a life suddenly derailed, she must also unwind the secrets of the people closest to her, and discover the power of a single day to make a difference, not just in her own life, but in the lives of those around her - before she runs out of time for good.",
    "cast": "Zoey Deutch, Halston Sage, Cynthy Wu",
	"director":  "Ry Russo-Young",
    "year": "2017",
    "trailer": "https://www.youtube.com/watch?v=q3Zyy4ZXegE"
}
,{
	"id": "038016",
	"title": "Wonder Woman",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038016.jpg",
    "summary": "When army pilot Steve Trevor crashes on the warriors' secluded island paradise, disrupting the fictitious all-female sanctuary of Themyscira created by the Gods of Olympus, Princess Diana of the immortal Amazons aids for his rescue and wins the decisive right to escort him home, heading to an early 20th Century London to stop the war she believes is influenced by the God Ares. Leaving behind the only life she's ever known and entering the cynical world of men for the first time, torn between a mission to promote peace and her own warrior upbringing, as a 'Wonder Woman,' Diana must fight evil in a 'war to end all wars,' while hoping to unlock the potential of a humanity she doesn't always understand.",
    "cast": "Gal Gadot, Chris Pine, Robin Wright ",
	"director":  "Patty Jenkins",
    "year": "2017",
    "trailer": "https://www.youtube.com/watch?v=VSB4wGIdDwo"
}
,{
	"id": "038017",
	"title": "Underworld Awakening",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038017.jpg",
    "summary": "Mankind discover the existence of the Vampire and Lycan species and they begin a war to annihilate the races. When Selene meets with Michael in the harbor, they are hit by a grenade and Selene passes out. Twelve years later, Selene awakes from a cryogenic sleep in the Antigen laboratory and meets the Vampire David. She learns that she had been the subject of the scientist Dr. Jacob Lane and the Vampire and Lycan species have been practically eradicated from Earth. But Selene is still connected to Michael and has visions that she believes that belongs to Michael's sight. However she has a surprise and finds that she has a powerful daughter named Eve that has been raised in the laboratory. Now Selene and David have to protect Eve against the Lycans that intend to use her to inoculate their species against silver.",
    "cast": "Kate Beckinsale, Michael Ealy, India Eisley",
	"director":  "Mans Marlind, Björn Stein",
    "year": "2012",
    "trailer": "https://www.youtube.com/watch?v=tUcrbUCWKQc"
}
,{
	"id": "038018",
	"title": "Doctor Strange",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038018.jpg",
    "summary": "Stephen Strange is a surgeon with a God complex. When he gets in an accident and his hands are injured, he feels as if his life is over. His therapist tells him of a guy he knew who couldn't walk but is now walking again. The therapist tells Strange where he can find the man and he tells Strange he did it with his mind, he went to a place called Kamar-Taj and there he was taught how to use his mind to heal himself. Strange goes there to seek the ones who taught him. He finds them and learns that they use mystic arts and they take Strange in, reluctantly and teach him. Strange learns that a former member is planning something and tries to stop him. But he also learns that his teacher is keeping a secret too.",
    "cast": "Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams",
	"director":  "Scott Derrickson",
    "year": "2016",
    "trailer": "https://www.youtube.com/watch?v=HSzx-zryEgM"
}
,{
	"id": "038019",
	"title": "Hanna",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038019.jpg",
    "summary": "Hanna (Ronan) is a teenage girl. Uniquely, she has the strength, the stamina, and the skills of a soldier; these come from being raised by her father (Bana), an ex-CIA man, in the wilds of Finland. Living a life unlike any other teenager, her upbringing and training have been one and the same, all geared to making her the perfect assassin. The turning point in her adolescence is a sharp one; sent into the world by her father on a mission, Hanna journeys stealthily across Europe while eluding agents dispatched after her by a ruthless intelligence operative with secrets of her own (Blanchett). As she nears her ultimate target, Hanna faces startling revelations about her existence and unexpected questions about her humanity.",
    "cast": "Saoirse Ronan, Cate Blanchett, Eric Bana",
	"director":  "Joe Wright",
    "year": "2011",
    "trailer": "https://www.youtube.com/watch?v=u73CLdHpbNk"
}
,{
	"id": "038020",
	"title": "Teenage Mutant Ninja Turtles: Out of the Shadows",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038020.jpg",
    "summary": "The Turtles continue to live in the shadows and no one knows they were the ones who took down Shredder. And Vernon is the one everyone thinks is the one who took Shredder down. April O'Neill does some snooping and learns a scientist named, Baxter Stockman is working for Shredder. He plans to break him out while he's being transported. April tells the turtles who try to stop it but can't. Stockman tries to teleport Shredder but he some how ends up in another dimension and meets a warlord named Krang who instructs Shredder to assemble a teleportation device he sent to Earth a long time ago. He gives Shredder some mutagen which he uses to transform two criminals who were also in the transport with him, Rock Steady and Bebop into mutants. And they set out to find the device. April saw the transformation while investigating Stockman, She would take the mutagen and she would be chased by Shredder's minions, the Foot Clan. He is saved by a man named Casey Jones who was the one who transporting Shredder. The Turtles show up and they try to work together. In the melee the mutagen ends up with the police. Knowing Shredder will try and get it back, April tries to get it first she asks Vern to help. Eventually she and Casey are arrested. The Turtles get the mutagen and Donatello analyzes it learns it could make them human, which he tells Leonardo who tells him to forget it and not to tell the others. But Michelangelo tells Raphael who feels that Leonardo doesn't respect them.",
    "cast": "Megan Fox, Will Arnett, Tyler Perry",
	"director":  "Dave Green",
    "year": "2016",
    "trailer": "https://www.youtube.com/watch?v=3CKgLNGfdSM"
}
,{
	"id": "038021",
	"title": "Wolves",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038021.jpg",
    "summary": "The teenager Cayden Richards lives in a small town with his parents Dean Richards and Janice Richards and is having violent nightmares. He is the quarterback of the local football team and his girlfriend Lisa Stewart is a cheerleader. After a game, Lisa decides to have sex with Cayden for the first time in the car. However he transforms into a monster and she flees from him. He goes home and finds his parents murdered. He leaves town hitchhiking while he is wanted by the police and he learns that his parents were actually stepparents. Cayden decides to find his origins and helps a prostitute at a truck stop that is assaulted by two men. Then he steals the motorcycle of one of the men and later he stops at a bar where he meets the weird Wild Joe. The stranger identifies that Cayden is a wolf and gives the direction to Lupine Ridge. Cayden arrives in a bar owned by the teenagers Angelina 'Angel' Timmins and Gail Timmins and he asks for a job, telling them his name is Danny. However he is not welcomed by the locals and he leaves the bar. But a man called John Tollerman hires him to work in his farm where he lives with his wife Clara Tollerman. Soon Cayden learns that John is his uncle and his mother was raped by the local leader Connor. He also finds that he is a pure town wolf together with John, Angeline, Gail and two other inhabitants. Connor is also pure, but has formed a pack of impure wolves and has a pact with the inhabitants to leave them in peace. But he is getting old and wants to have a baby with Angelina as part of the deal. But the problem is, Cayden and Angelina have fallen in love with each other and Cayden intends to stop Connor.",
    "cast": "Lucas Till, Stephen McHattie, John Pyper-Ferguson",
	"director":  "David Hayter",
    "year": "2014",
    "trailer": "https://www.youtube.com/watch?v=ZN71HDzBQjU"
}
,{
	"id": "038022",
	"title": "The Host",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038022.jpg",
    "summary": "A race of non-corporeal, parasitic aliens who go from planet to planet looking for hosts have come to Earth and basically taken over the human race. It's believed that, once inside a body, all memories of the host human are gone. Some few free humans remain hidden from them, forming a resistance group. When an alien Seeker captures a girl named Melanie and puts a Wanderer in her body, she hopes to find out where the remaining humans are gathered, but Melanie, a strong fighter able to converse with the alien in her commandeered body, convinces the Wanderer to say nothing. Disappointed by the lack of progress (though suspecting an empathy for the human), the Seeker informs the Wanderer that she'll be removed and placed in a new host while she herself will enter Melanie. With human lives at risk, Melanie convinces Wanderer to run away and hide out with the humans, but finding them doesn't mean they'll allow an alien presence among them. Jared (Melanie's boyfriend) wants her dead, but Jeb (Melanie's uncle) wants to wait, and Ian, tasked with guarding her, finds himself siding with Jeb. As Ian begins to fall for Melanie, a strange love triangle develops, with Ian wanting Wanderer (inhabiting Melanie's body), Jared wanting Melanie (imprisoned inside her own body), and no one knowing any way to separate the two without killing both.",
    "cast": "Saoirse Ronan, Max Irons, Jake Abel",
	"director":  "Andrew Niccol",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=uNeCnKKHGE4"
}
,{
	"id": "038023",
	"title": "Conan the Barbarian",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038023.jpg",
    "summary": "Many years ago, sorcerers crafted the Mask of Acheron and dark forces of Acheron conquered the world. However, the barbarians vanquished Acheron warriors and broke the Mask into pieces and divided among the tribes. The barbarian Cimmerian village of chief Corin is attacked by the evil warlord Khalar Zym that wants the last piece of bone of the Mask of Acheron to resurrect his wife. When his witch daughter Marique finds the hidden piece, he slaughters the villagers and the Corin's son Conan is the only survivor. Conan swears revenge against Khalar Zym. Years later, the warrior Conan is a pirate and he decides to release slaves from a field. When he is celebrating in a tavern with his friends, he sees a thief being chased by a guard and Conan recognizes him as Lucius, the Khalar Zym's soldier that he cut the nose out. Conan let the guards capture him and once in the prison, he forces Lucius to tell him where Khalar Zym is. Meanwhile Khalar Zym attacks a monastery where Marique believes that a pure-blood descent of Acheron lives. But the monk sent the descent Tamara back to her homeland. She is chased by Khalar Zym's soldiers, but Conan saves her. Now Conan intends to use Tamara to reach the evil Khalar Zym. Will he succeed in his intent?",
    "cast": "Jason Momoa, Ron Perlman, Rose McGowan",
	"director":  "Marcus Nispel",
    "year": "2011",
    "trailer": "https://www.youtube.com/watch?v=P3L7tRQzDEQ"
}
,{
	"id": "038024",
	"title": "The Mortal Instruments: City of Bones",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038024.jpg",
    "summary": "Set in contemporary New York City, a seemingly ordinary teenager, Clary Fray, discovers she is the descendant of a line of Shadowhunters, a secret cadre of young half-angel warriors locked in an ancient battle to protect our world from demons. After the disappearance of her mother, Clary must join forces with a group of Shadow Hunters, who introduce her to a dangerous alternate New York called the Shadow World, filled with demons, warlocks, vampires, werewolves and other deadly creatures.",
    "cast": "Lily Collins, Jamie Campbell Bower, Robert Sheehan",
	"director":  "Harald Zwart",
    "year": "2013",
    "trailer": "https://www.youtube.com/watch?v=GHlwRsl2uFk"
}
,{
	"id": "038025",
	"title": "Abattoir",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038025.jpg",
    "summary": "An investigative reporter works to solve the mystery behind a mysterious man who has been buying houses where tragedies have occurred. Set in a world where it always feels like night, even in daylight hours, real estate reporter Julia Talben's life is turned upside down when her family is brutally murdered. It is believed to be an open and close case, but Julia quickly realizes there is much more to this story when she returns to the crime scene to find the murder room deconstructed and physically removed from her sister's home. This ignites an investigative pursuit that eventually leads her and ex-lover Detective Declan Grady to the town of New English where they find the enigmatic Jebediah Crone and the Abattoir - a monstrous house stitched together with unending rooms of death and the damned. Julia comes to realize that her sister's soul is trapped inside, but the Abattoir isn't just a house - it's a door to something more evil than anyone could have ever imagined. Julia and Grady are ultimately faced with the question: How do you build a haunted house? One room at a time.",
    "cast": "Jessica Lowndes, Joe Anderson, Lin Shaye",
	"director":  "Darren Lynn Bousman",
    "year": "2016",
    "trailer": "https://www.youtube.com/watch?v=dUI5tBtfgCk"
}
,{
	"id": "038026",
	"title": "Knock Knock",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038026.jpg",
    "summary": "When a devoted husband and father is left home alone for the weekend, two stranded young women unexpectedly knock on his door for help. What starts out as a kind gesture results in a dangerous seduction and a deadly game of cat and mouse. A sexy new thriller from director Eli Roth and written for the screen by Eli Roth & Nicolás López & Guillermo Amoedo and story by Anthony Overman and Michael Ronald, KNOCK KNOCK stars Keanu Reeves as the family man who falls into temptation and Lorenza Izzo and Ana de Armas as the seductresses who wreak havoc upon his life, turning a married man's dark fantasy into his worst nightmare. KNOCK KNOCK will be released by Lionsgate Premiere in theaters and On Demand on October 9th.",
    "cast": "Keanu Reeves, Lorenza Izzo, Ana de Armas",
	"director":  "Eli Roth",
    "year": "2016",
    "trailer": "https://www.youtube.com/watch?v=ti6S3NZ5mKI"
}
,{
	"id": "038027",
	"title": "The Jungle Book",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038027.jpg",
    "summary": "The boy Mowgli is raised in the jungle by the female wolf Raksha with her cubs in the pack led by Akela. The panther Bagheera saved Mowgli when he was a baby and delivered him to Raksha. During the drought, the animals celebrate truce to drink water around the Peace Rock together, but the cruel tiger Shere Khan sees Mowgli and promises to kill him when the water return. Bagheera decides to guide Mowgli to a village on the outskirts of the woods, but they are attacked by Shere Khan during their journey. Mowgli flees but the anaconda Kaa attacks him; however the bear Baloo saves him and they become friends. But Shere Khan wants to kill Mowgli and no animal is capable to stop him. What will happen to Mowgli?",
    "cast": "Neel Sethi, Bill Murray, Ben Kingsley",
	"director":  "Jon Favreau",
    "year": "2016",
    "trailer": "https://www.youtube.com/watch?v=5mkm22yO-bs"
}
,{
	"id": "038028",
	"title": "The Abandoned",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038028.jpg",
    "summary": "Take a terrifying plunge into the warped mind of a disturbed young woman. Desperate to get her life back on track, the unstable Streak takes a job as a security guard, working the graveyard shift at a once upscale, now abandoned apartment complex. But on her first night on duty, she discovers a horrifying presence lurking deep within the bowels of the decaying building. With her nerves already on edge, Streak must confront demons both real and imagined as she struggles to keep a grip on her sanity.",
    "cast": "Jason Patric, Louisa Krause, Mark Margolis",
	"director":  "Eytan Rockaway",
    "year": "2015",
    "trailer": "https://www.youtube.com/watch?v=mdlpQe4Jsa8"
}
,{
	"id": "038029",
	"title": "Passengers",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038029.jpg",
    "summary": "A company offers people the opportunity to leave the Earth and live on a new colony called Homestead 2. They are being transported on a space vessel called the Avalon. The journey takes 120 years so the travelers and crew are kept in hibernation chambers while the ship flies on its own and are to be awaken just before they arrive. When one passenger -Jim Preston - is awoken, he goes around the ship he discovers he's the only one awake, having been woken 90 years early. He tries to reenter his hibernation pod but can't, and spends the next year by himself. He looks at the videos of the other passengers and one, Aurora Lane, intrigues him. He then has to decide if he should wake her up. Eventually he does and they try to make the best of their time together. But then they realise; something must've happened to the ship for it to awaken him, and they set out to find out what it is.",
    "cast": "Jennifer Lawrence, Chris Pratt, Michael Sheen",
	"director":  "Morten Tyldum",
    "year": "2016",
    "trailer": "https://www.youtube.com/watch?v=7BWWWQzTpNU"
}
,{
	"id": "038030",
	"title": "The Ides of March",
    "poster": "https://raw.githubusercontent.com/android10/Sample-Data/master/Android-CleanArchitecture-Kotlin/posters/038030.jpg",
    "summary": "The Democratic Party presidential primary process is currently in Ohio, where two candidates are realistically still in the running as the ultimate party nominee for president: Pennsylvanian Governor, Mike Morris, and Arkansas senator, Ted Pullman. Based on what is happening on the Republican side, the Democrats are likely to win the White House, and whoever wins the Ohio primary will likely be the Democratic candidate. Under campaign manager Paul Zara, thirty year old Stephen Meyers is the idealistic press secretary for the Morris campaign. Although Stephen is a political veteran, he has never felt more passionately about a candidate than Morris, who outwardly aspires to a campaign that deals with his policies reflecting his ideals as opposed to back room politics. Stephen takes a calculated risk, one that does not pay off as his actions are leaked to reporter Ida Horowicz, who had been friendly to the campaign up to this point. Ida gives Stephen the opportunity to confirm or deny the accusations before she goes to print, the story which would ruin his standing within the campaign. Stephen also begins a casual sexual relationship with twenty year old intern Molly Stearns, who is well connected herself within the party as the daughter of Jack Stearns, the Chair of the Democratic National Committee. Through Molly, Stephen inadvertently comes into knowledge of some scandalous information about Morris. Stephen has to decide how all these revelations affect his own idealistic attitudes of working under Morris and Zara, and if Morris winning the White House is still the most important goal, especially at the risk of his own professional future within the party and possibly within government.",
    "cast": "Paul Giamatti, George Clooney, Philip Seymour Hoffman",
	"director":  "George Clooney",
    "year": "2011",
    "trailer": "https://www.youtube.com/watch?v=y494hUO-aw8"
}
]}
